#include <iostream>
#include <string>
#include <Windows.h>
#include "ModulesFedotov.h"
using namespace std;


void test_printWindSpeedInfo() {
    string expectedOutputs[13] = {
    "Швидкість вітру: 0 - 0.3 м/с (0 - 1.08 км/ч)\nОпис: Відсутність вітру. Дим піднімається прямо. Листя дерев нерухомі.\n",
    "Швидкість вітру: 0.3 - 1.5 м/с (1.08 - 5.4 км/ч)\nОпис: Дим 'пливе'. Флюгер не обертається.\n",
    "Швидкість вітру: 1.6 - 3.4 м/с (5.76 - 12.24 км/ч)\nОпис: Рух повітря відчувається обличчям. Шелестить листя.\n",
    "Швидкість вітру: 3.5 - 5.4 м/с (12.6 - 19.44 км/ч)\nОпис: Тріпоче листя, хитаються дрібні гілки. Майорять прапори.\n",
    "Швидкість вітру: 5.5 - 7.9 м/с (19.8 - 28.44 км/ч)\nОпис: Хитаються тонкі гілки дерев. Вітер піднімає пил та шматки паперу.\n",
    "Швидкість вітру: 8 - 10.7 м/с (28.8 - 38.52 км/ч)\nОпис: Хитаються великі гілки. На воді з’являються хвилі.\n",
    "Швидкість вітру: 10.8 - 13.8 м/с (38.88 - 49.68 км/ч)\nОпис: Хитаються великі гілки.\n",
    "Швидкість вітру: 13.9 - 17.1 м/с (50.04 - 61.56 км/ч)\nОпис: Хитаються невеликі стовбури дерев. На морі здіймаються хвилі.\n",
    "Швидкість вітру: 17.2 - 20.7 м/с (61.92 - 74.52 км/ч)\nОпис: Ламаються гілки дерев. Важко йти проти вітру.\n",
    "Швидкість вітру: 20.8 - 24.4 м/с (74.88 - 87.84 км/ч)\nОпис: Невеликі руйнування. Зриває покрівлі, руйнує димарі.\n",
    "Швидкість вітру: 24.5 - 28.4 м/с (88.2 - 102.24 км/ч)\nОпис: Значні руйнування. Дерева вириваються з корінням.\n",
    "Швидкість вітру: 28.5 - 32.6 м/с (102.6 - 117.36 км/ч)\nОпис: Великі руйнування.\n",
    "Швидкість вітру: 32.7 - 50 м/с (117.72 - 180 км/ч)\nОпис: Призводить до спустошень.\n",
    };

    cout << "Запуск тестів для функції printWindSpeedInfo:\n";

    for (int i = 0; i < 14; i++) {
        string actualOutput = printWindSpeedInfo(i);

        cout << "\nТест кейс #" << (i + 1) << " | Бал Бофорта: " << i << "\n";
        cout << "Результат: " << actualOutput << "\n";

        if (actualOutput == expectedOutputs[i]) {
            cout << "Фактичний результат: PASSED\n";
        }
        else {
            cout << "Фактичний результат: FAILED\n";
        }
        cout << "--------------------------------------\n";
    }
}

int main() {
    SetConsoleOutputCP(1251);
    test_printWindSpeedInfo();
    system("pause");
    return 0;
}